---
kind: property
id: P:Autodesk.Revit.DB.Visual.MetallicPaint.MetallicpaintPearl
source: html/b15dd4a4-eefd-ef84-661d-47dfa23f3b56.htm
---
# Autodesk.Revit.DB.Visual.MetallicPaint.MetallicpaintPearl Property

The property labeled "Pearl" from the "MetallicPaint" schema.

## Syntax (C#)
```csharp
public static string MetallicpaintPearl { get; }
```

## Remarks
This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "MetallicpaintPearlType".